
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализироватьТабличныйДокумент()
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьТабличныйДокумент()
	
	Об = РеквизитФормыВЗначение("Объект");
	Макет = Об.ПолучитьМакет("ШапкаЗагрузкиДанных");
	
	ДанныеЗагрузки.Очистить();
	
	ОбластьРаботы = Макет.ПолучитьОбласть("ШапкаЗагрузкиДанных");
	ДанныеЗагрузки.Присоединить(ОбластьРаботы);
	
	ДанныеЗагрузки.ФиксацияСверху = 2;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Структура = Новый Структура;
	Структура.Вставить("АдресВХранилище", АдресВХранилище);
	
	ОповеститьОВыборе(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанные(Команда)
	
	АдресВХранилище = ПоместитьВоВременноеХранилище(ДанныеЗагрузки, Новый УникальныйИдентификатор);
	
	ЭтаФорма.Закрыть(КодВозвратаДиалога.OK);
	
КонецПроцедуры

